      <?php
      $menu = [
            'Меню' => ['О компании'=>['элемент меню','элемент меню2'], ,
            'Второй пункт' => ['Товары', 'Колеса','Руль'],
            'Третий пункт' => ['Покупателю', 'Гарантия', "Бонусы"],
        ];
         $str = '<ul>';

        foreach ($menu as $item => $key) {
      if (is_arry($key)) {
          $str .="<li>$item</li></ul>";
          foreach($key as $item => $key) {
              $str .="</ul>";
          } else {
              $str .= "<a></a>"
          }
      }

        ?>