      <?php
function transLit ($str) {
        $alphabet = [ "а" => "a",  "б" => "b",  "в"  => "v", "г"  => "g", "д"  => "d",  "е"  => "e",
                "ё" => "yo", "ж" => "zh", "з"  => "z", "и"  => "i", "й"  => "j",  "к"  => "k",
                "л" => "l",  "м" => "m",  "н"  => "n", "о"  => "o", "п"  => "p",  "р"  => "r",
                "с" => "s",  "т" => "t",  "у"  => "u", "ф"  => "f", "х"  => "x",  "ц"  => "c",
                "ч" => "ch", "ш" => "sh", "щ"  => "sch", "ь"  => "'", "ы"  => "yh", "ъ"  => "'",
                "э" => "eh", "ю" => "yu", "я"  => "ya"];
             return strtr(mb_strtolower ($str), $alphabet);
}
echo translit("Наталья");
  ?>